{"secure_media_embed":{},"secure_media":null,"banned_by":null,"thumbnail":"self","id":"1fu0yu","title":"I believe nihilism is a fundamentally flawed philosophy. CMV","mod_reports":[],"selftext":"I believe that the idea that life has no meaning is entirely ridiculous. Nihilists, to continue accepting their philosophy, must willfully ignore every possible source of happiness that anyone has ever enjoyed, and this seems ignorant and short-sighted. Honestly, they come across similar to angsty teenagers. Please, CMV.","selftext_html":"&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I believe that the idea that life has no meaning is entirely ridiculous. Nihilists, to continue accepting their philosophy, must willfully ignore every possible source of happiness that anyone has ever enjoyed, and this seems ignorant and short-sighted. Honestly, they come across similar to angsty teenagers. Please, CMV.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;","edited":false,"is_self":true,"media_embed":{},"permalink":"/r/changemyview/comments/1fu0yu/i_believe_nihilism_is_a_fundamentally_flawed/","ups":8,"downs":0,"gilded":0,"subreddit_id":"t5_2w2s8","author":"rubywoundz","link_flair_css_class":null,"author_flair_css_class":null,"num_comments":31,"user_reports":[],"distinguished":null,"link_flair_text":null,"stickied":false,"author_flair_text":null,"score":8,"report_reasons":null,"over_18":false,"subreddit":"changemyview","media":null,"url":"http://www.reddit.com/r/changemyview/comments/1fu0yu/i_believe_nihilism_is_a_fundamentally_flawed/","retrieved_on":1412267805,"domain":"self.changemyview","created_utc":1370568992}
{"num_comments":28,"created_utc":1370962373,"link_flair_css_class":null,"author_flair_css_class":null,"edited":false,"report_reasons":null,"id":"1g4gq2","downs":0,"subreddit_id":"t5_2w2s8","secure_media_embed":{},"ups":0,"over_18":false,"banned_by":null,"selftext_html":"&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have no problem with the NSA scanning my emails/phone records in the interests of national security. In fact, I think it&amp;#39;s a little silly for the average person to be worried that they&amp;#39;ll be snatched up by the government for... well, no one ever seems to give a reason, they just assume the government is after them.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also surprised that so many people are invoking the slippery slope argument. Do you really think the U.S. government can get away with a totalitarian state? Think of the manpower required to pull that off without full-scale revolt.&lt;/p&gt;\n\n&lt;p&gt;I think that some concessions in privacy are to be expected if people want to feel secure. We (or a majority, at least) already post all our thoughts and location to Faacebook, Twitter, Instagram, Google Maps, etc.  If we agree to give those &amp;quot;freedoms&amp;quot; up for a company, surely we&amp;#39;d give them up to catch would-be terrorists?&lt;/p&gt;\n\n&lt;p&gt;Now, after all of that, you might be wondering why I want to change my view. Well, with everyone outraged, I feel like I&amp;#39;m missing something. Reddit, cut through the hyperbole and CMV.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;","media_embed":{},"mod_reports":[],"thumbnail":"self","link_flair_text":null,"domain":"self.changemyview","gilded":0,"score":0,"subreddit":"changemyview","retrieved_on":1412226311,"title":"I'm actually ok with the NSA's actions so far. CMV","secure_media":null,"stickied":false,"selftext":"I have no problem with the NSA scanning my emails/phone records in the interests of national security. In fact, I think it's a little silly for the average person to be worried that they'll be snatched up by the government for... well, no one ever seems to give a reason, they just assume the government is after them.\n\nI'm also surprised that so many people are invoking the slippery slope argument. Do you really think the U.S. government can get away with a totalitarian state? Think of the manpower required to pull that off without full-scale revolt.\n\nI think that some concessions in privacy are to be expected if people want to feel secure. We (or a majority, at least) already post all our thoughts and location to Faacebook, Twitter, Instagram, Google Maps, etc.  If we agree to give those \"freedoms\" up for a company, surely we'd give them up to catch would-be terrorists?\n\nNow, after all of that, you might be wondering why I want to change my view. Well, with everyone outraged, I feel like I'm missing something. Reddit, cut through the hyperbole and CMV.","author":"punchingbagaccount","is_self":true,"distinguished":null,"author_flair_text":null,"permalink":"/r/changemyview/comments/1g4gq2/im_actually_ok_with_the_nsas_actions_so_far_cmv/","user_reports":[],"media":null,"url":"http://www.reddit.com/r/changemyview/comments/1g4gq2/im_actually_ok_with_the_nsas_actions_so_far_cmv/"}
{"author_flair_text":null,"downs":0,"distinguished":null,"author":"ravingraven","selftext_html":"&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There has been this unbelievable flood of posts and comments about how the Travyon Martin case should be only between the parties directly involved and that it should be treated just like any other murder of a black person.&lt;/p&gt;\n\n&lt;p&gt;I disagree with that for three reasons:&lt;/p&gt;\n\n&lt;p&gt;First, the Travyon Martin case is de facto not &amp;quot;just another case&amp;quot; because it gathered national attention. People argue that this is because of the media (which is partially true) but they forget that the reason it first attracted attention was because Zimmerman was on a neighbourhood watch. It raised questions about whether practices such as the neighbourhood watch and being allowed to carry a firearm led to the death of Travyon Martin.&lt;/p&gt;\n\n&lt;p&gt;Second, while it is very difficult to argue that Zimmerman should have been ruled guilty for happened that night that does not mean that the fairness of self defence or gun control laws should not be debated. What is legal is not always right and, more importantly, what is legal does not reflect the views of the community about what should be allowed.&lt;/p&gt;\n\n&lt;p&gt;Also, it is viewer and reader attention (at least in this case) that lead the media to sensationalize the story which should also raise questions about how we, as consumers of media information reacted to the death of Martin.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;","user_reports":[],"link_flair_text":null,"edited":false,"selftext":"There has been this unbelievable flood of posts and comments about how the Travyon Martin case should be only between the parties directly involved and that it should be treated just like any other murder of a black person.\n\nI disagree with that for three reasons:\n\nFirst, the Travyon Martin case is de facto not \"just another case\" because it gathered national attention. People argue that this is because of the media (which is partially true) but they forget that the reason it first attracted attention was because Zimmerman was on a neighbourhood watch. It raised questions about whether practices such as the neighbourhood watch and being allowed to carry a firearm led to the death of Travyon Martin.\n\nSecond, while it is very difficult to argue that Zimmerman should have been ruled guilty for happened that night that does not mean that the fairness of self defence or gun control laws should not be debated. What is legal is not always right and, more importantly, what is legal does not reflect the views of the community about what should be allowed.\n\nAlso, it is viewer and reader attention (at least in this case) that lead the media to sensationalize the story which should also raise questions about how we, as consumers of media information reacted to the death of Martin.","subreddit_id":"t5_2w2s8","id":"1iemb9","over_18":false,"thumbnail":"self","ups":1,"url":"http://www.reddit.com/r/changemyview/comments/1iemb9/i_think_that_the_death_of_travyon_martin_is/","score":1,"mod_reports":[],"link_flair_css_class":null,"media_embed":{},"author_flair_css_class":null,"secure_media_embed":{},"retrieved_on":1412048396,"banned_by":null,"media":null,"stickied":false,"title":"I think that the death of Travyon Martin is indicative of how people in the USA view violence and security and it must be analysed and debated. CMV.","gilded":0,"secure_media":null,"num_comments":12,"domain":"self.changemyview","subreddit":"changemyview","is_self":true,"created_utc":1373971670,"report_reasons":null,"permalink":"/r/changemyview/comments/1iemb9/i_think_that_the_death_of_travyon_martin_is/"}
{"domain":"self.changemyview","hide_score":false,"media_embed":{},"subreddit":"changemyview","created_utc":"1396716034","author_flair_text":null,"title":"CMV: If society thinks a 35 year old man is wrong for wanting, and trying, to have sex with a 17 year old girl, society is based on lies","secure_media_embed":{},"distinguished":null,"downs":0,"thumbnail":"default","permalink":"/r/changemyview/comments/22a37m/cmv_if_society_thinks_a_35_year_old_man_is_wrong/","link_flair_text":null,"retrieved_on":1441593175,"ups":1092,"media":null,"selftext":"","archived":true,"id":"22a37m","name":"t3_22a37m","link_flair_css_class":null,"gilded":0,"saved":false,"over_18":false,"num_comments":789,"author_flair_css_class":null,"is_self":true,"author":"Vietnom","from":null,"stickied":false,"secure_media":null,"url":"http://www.reddit.com/r/changemyview/comments/22a37m/cmv_if_society_thinks_a_35_year_old_man_is_wrong/","created":1396719634,"from_kind":null,"subreddit_id":"t5_2w2s8","from_id":null,"quarantine":false,"edited":false,"score":1092}
{"retrieved_on":1441204863,"ups":67,"media":null,"selftext":"When someone is in high school, it does not make sense to have a committed romantic relationship. Romantic relationship is defined as a mutual agreement of exclusivity in dating, and being referred to as together.\n\nThe first point I have is that in a purely practical sense, dating should be seen from a breadth first approach. It is more pragmatic to date many people and learn what your particular tastes are than to learn it by stumbling through a series of relationships that fall apart and tripping right into the next one. This is emotionally taxing.\n\nSecond, as teenagers have not matured enough yet to what they will be as adults. You can't really understand the significance of that intimacy at that time. One just is not ready until a later age\n\nThird, relationships are distracting, expensive and time consuming. High school is often what decides the course of someone's life, and it is not wise to mess with something that powerful. I have seen many people throw their lives away for their boyfriend or girlfriend, and it seems that it just is not worth the risk.\n\nEDIT: Please note I am only saying that people shouldn't get into serious relationships, not that dating should stop altogether.\n\nAnswer this and I will be convinced; Is it vital that someone gets relationship experience in high school? Would in not be bennifical to date noncommittally until after graduation?\n\nTo support this I point to the statistic brought up by u/tomrhod:\n\n&gt;The key is that the research shows that starting in the 1980s education, specifically a college degree for women, began to create a substantial divergence in marital outcomes, with the divorce rate for college-educated women dropping to about 20 percent, half the rate for non-college educated women. Even this is more complex, since the non-college educated women marry younger and are poorer than their college grad peers. These two factors, age at marriage and income level, have strong relationships to divorce rates; the older the partners and the higher the income, the more likely the couple stays married.\n... A closer look at even these lower rates indicate that there are really two separate groups with very different rates: a woman who is over 25, has a college degree, and an independent income has only a 20 percent probability of her marriage ending in divorce; a woman who marries younger than 25, without a college degree and lacking an independent income has a 40 percent probability of her marriage ending in divorce.\n\nPlease, CMV\n\nEdit 2:\n\nThe multitude of stories changed my view. Thanks!\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*","permalink":"/r/changemyview/comments/2eez7x/cmv_romantic_relationships_in_high_school_are_not/","link_flair_text":null,"title":"CMV: Romantic relationships in high school are not worth the trouble","secure_media_embed":{},"distinguished":null,"downs":0,"thumbnail":"self","domain":"self.changemyview","hide_score":false,"media_embed":{},"subreddit":"changemyview","created_utc":"1408849022","author_flair_text":"1∆","quarantine":false,"score":67,"edited":1408931556,"stickied":false,"url":"http://www.reddit.com/r/changemyview/comments/2eez7x/cmv_romantic_relationships_in_high_school_are_not/","secure_media":null,"subreddit_id":"t5_2w2s8","from_kind":null,"created":1408852622,"from_id":null,"is_self":true,"author":"tctimomothy","from":null,"archived":true,"id":"2eez7x","gilded":0,"link_flair_css_class":null,"name":"t3_2eez7x","saved":false,"over_18":false,"author_flair_css_class":" points","num_comments":58}
{"stickied":false,"secure_media":null,"url":"http://www.reddit.com/r/changemyview/comments/2k0t4m/cmv_i_have_recently_come_to_the_conclusion_that/","subreddit_id":"t5_2w2s8","created":1414009828,"from_kind":null,"from_id":null,"quarantine":false,"score":19,"edited":1414014888,"archived":true,"id":"2k0t4m","name":"t3_2k0t4m","link_flair_css_class":null,"gilded":0,"saved":false,"over_18":false,"author_flair_css_class":" points","num_comments":177,"is_self":true,"author":"Unrelated_Incident","from":null,"permalink":"/r/changemyview/comments/2k0t4m/cmv_i_have_recently_come_to_the_conclusion_that/","link_flair_text":null,"retrieved_on":1441109659,"ups":19,"media":null,"selftext":"I see very little difference between killing a pig for its meat and killing a dog for fun.  To change my view you will need to either convince me that there is a significant fundamental difference between the two, or that it’s ok to kill dogs for fun. \n\nAs someone who really enjoys eating meat, I would really like for my view to be changed.  I have spoken with a few people about this in the hopes that they would convince me that it’s ok to continue eating meat, but so far the arguments have been entirely unconvincing.\n\nI’d like to pre-emptively address some arguments that I do not find compelling.\n\n*1.  People need to eat to survive; therefore eating meat is morally acceptable.*\n\nI do not find this answer compelling because we do not have to eat *meat* to survive.  We can live perfectly healthy lives without eating any meat.  Eating meat is certainly enjoyable to many people but that is hardly a justification.  Some people enjoy killing dogs and I don’t consider that an acceptable justification.\n\n*2.  Eating meat is natural.  We have been doing it since we were cavemen.*\n\nRaping people is also natural and we have also been doing it since we were cavemen.\n\n*3.  We have domesticated some animals to the point where they cannot survive in nature.  If we were to not raise them for consumption, they would go extinct.*\n\nI am not sure that I am really opposed to the extinction of species that cannot survive in nature, but if I were, I suppose we could make a small nature preserve where 1000 cows, pigs, and chickens live.  If you are going to complain about the cost, rest assured that the cost would be far outweighed by our consumption of more efficient food.\n\n*4.  If the animals are raised in a humane way and slaughtered painlessly and without causing them any fear, what’s the problem?*\n\nI’m not 100% sure why I feel like it is wrong.  But I do know that if someone liked to adopt puppies, treat them humanely, and then execute them in a painless manner just for fun, it seems morally reprehensible to me.  Maybe someone can explain why I feel this way or convince me that it’s ok.\n\n*5.  Killing dogs for fun is ok because they don’t have a soul or aren’t self-aware or something like that.*\n\nI don’t think there is anything fundamentally different about a dog and a human that would make it ok to kill one and not the other without a pretty good reason.\n\n*6.  What about fish?  What about eggs?  What about spinach?  It’s alive too.  You have to draw the line somewhere.*\n\nThat’s true.  I’m not sure where the line should be but I do know that pigs are as smart and adorable as dogs so I don’t see why any rules of morality should extend to one and not the other.\n\n\n**EDITS**\n*7.  Animals kill other animals for food.  Is that immoral?*\n\nMany animals do not have a choice but to eat meat. In those cases it is not immoral for them to kill for food. In the cases of animals that are perfectly capable of subsisting without killing, I would say that they are behaving in an immoral way, but I don't blame them since they probably lack the reasoning capacity to think about this situation from the other creature's point of view.\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*","domain":"self.changemyview","hide_score":false,"media_embed":{},"subreddit":"changemyview","created_utc":"1414006228","author_flair_text":"1∆","title":"CMV: I have recently come to the conclusion that killing animals for meat is immoral. Please change my view.","secure_media_embed":{},"distinguished":null,"downs":0,"thumbnail":"self"}
{"url":"http://www.reddit.com/r/changemyview/comments/2mmxvt/cmv_i_dont_think_fat_shaming_is_a_bad_thing/","secure_media":null,"from_kind":null,"created":1416287169,"subreddit_id":"t5_2w2s8","from_id":null,"stickied":false,"quarantine":false,"edited":false,"score":14,"saved":false,"over_18":false,"author_flair_css_class":null,"num_comments":93,"archived":true,"id":"2mmxvt","name":"t3_2mmxvt","gilded":0,"link_flair_css_class":null,"author":"throwawaygaydude","from":null,"is_self":true,"permalink":"/r/changemyview/comments/2mmxvt/cmv_i_dont_think_fat_shaming_is_a_bad_thing/","link_flair_text":null,"media":null,"selftext":"I mean, it's an established fact that if you are fat, you're unhealthy. Shouldn't we be discouraging unhealthy behavior by encouraging others to live a healthier, more active lifestyle?\n\nI've honestly never understood why ridiculing someone's poor life choices is considered a bad thing. The same goes for people who are anorexic, bulimic, etc. Why is it considered a good thing to encourage people to basically slowly kill themselves instead of make them confront their problems head on?\n\nAnd I get it, the media is always depicting people that 99% of the population will never be able to look like. That's not what I'm going after. It just seems like that if someone calls a morbidly obese person \"gross and disgusting,\" suddenly that person is an asshole. But is that person not correct? Being fat *is* gross and disgusting. It's not like someone is saying \"all black people are disgusting criminals,\" because that statement that would be racist and entirely untrue. So why are people who tell the truth by calling out fat people for living shitty lives considered to be on the same level as racists? \n\nI mean like, if you get that offended over someone telling you the truth, why not just lose weight instead of complaining? It's really not that hard to lose weight.\n\nAnd I know some people may say, \"but men/women love curves/people with meat on their bones!\" But let's be honest here: 99% of people don't think that way, and you'd be kidding yourself if you thought otherwise.","retrieved_on":1441065227,"ups":14,"media_embed":{},"subreddit":"changemyview","created_utc":"1416287169","author_flair_text":null,"domain":"self.changemyview","hide_score":false,"distinguished":null,"downs":0,"thumbnail":"self","title":"CMV: I don't think \"fat shaming\" is a bad thing.","secure_media_embed":{}}
{"domain":"self.changemyview","hide_score":false,"created_utc":"1422747367","author_flair_text":null,"media_embed":{},"subreddit":"changemyview","title":"CMV: Watches today serve no functional purpose other than fashion, and therefore are a waste of money","secure_media_embed":{},"downs":0,"thumbnail":"self","distinguished":null,"link_flair_text":null,"permalink":"/r/changemyview/comments/2ucr50/cmv_watches_today_serve_no_functional_purpose/","ups":2,"retrieved_on":1440933895,"selftext":"Many years ago, watches served the purpose of being able to tell time.  Now, with cell phones, as well as a plethora of other personal devices that are able to tell time, watches are functionally useless.  In my opinion, the only reason watches still exist are for fashion appeal, which I find stupid.  Yeah boots cost $100+, but they serve a niche purpose that hasn't been filled by another item.  I just think it's asinine to spend $100+ dollars on an item with no functional purpose for the sake of being fashionable.  Maybe being a broke college student affects this belief but I just do not understand the reason why watches still exist in today's time, no pun intended. CMV.\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*","media":null,"gilded":0,"name":"t3_2ucr50","link_flair_css_class":null,"archived":true,"id":"2ucr50","num_comments":41,"author_flair_css_class":null,"saved":false,"over_18":false,"is_self":true,"from":null,"author":"COLON_DESTROYER","stickied":false,"from_id":null,"secure_media":null,"url":"http://www.reddit.com/r/changemyview/comments/2ucr50/cmv_watches_today_serve_no_functional_purpose/","subreddit_id":"t5_2w2s8","created":1422747367,"from_kind":null,"score":2,"edited":false,"quarantine":false}
{"hide_score":false,"created_utc":1468738897,"url":"https://www.reddit.com/r/changemyview/comments/4t8mmw/cmv_transgenders_only_enforce_gender_stereotypes/","secure_media_embed":{},"quarantine":false,"author":"Amaizeing39","media":null,"locked":false,"retrieved_on":1472963252,"from_kind":null,"over_18":false,"saved":false,"id":"4t8mmw","stickied":false,"num_comments":100,"subreddit_id":"t5_2w2s8","from_id":null,"author_flair_text":null,"link_flair_text":"[∆(s) from OP]","selftext":"I try not to be bigoted, and I'd really like to open my mind to this, especially as my cousin begins his HRT. I'm a strong liberal, but I believe the concept of transgender individuals is tied strongly to the concept of gender roles. Why bother changing your gender, or identifying as a different one, if they are equal? Dysphoria is a real issue, but that's purely psychological. If someone truly believed man = woman, then why would they feel the need to be one or the other. Men can wear make up, nail polish, dresses, suits, high heels, and be nurturing. Women can do the same. When I was little, they called me a tomboy. I prefer video games and basketball to shopping. I don't doubt I'm a woman, because I've seen myself in the mirror. Gender isn't real, sex is. You were born male or female (or the medical anomaly of intersex), and it doesn't change a thing, and neither will changing what's in your pants.\nWith that said, I know this is a touchy subject, and I genuinely don't mean to offend, only to educate myself.\n\n\nEDIT: I'd say my view has been successfully changed, though I'm still interested in learning more about the non-cis thought processes and what it's like being trans in today's society.","score":125,"author_flair_css_class":null,"downs":0,"secure_media":null,"domain":"self.changemyview","ups":125,"distinguished":null,"link_flair_css_class":"OPdelta","thumbnail":"self","media_embed":{},"from":null,"archived":false,"gilded":0,"title":"CMV: Transgenders only enforce gender stereotypes.","edited":1468793248,"permalink":"/r/changemyview/comments/4t8mmw/cmv_transgenders_only_enforce_gender_stereotypes/","is_self":true,"name":"t3_4t8mmw","subreddit":"changemyview"}
{"link_flair_text":"[∆(s) from OP]","selftext":"In the college environment we are supposed to be challenging old ideas and popular opinions. Safe spaces go against the logic of the scientific method because they leave no room for hypotheses that offend or discomfort people. This is the same line of thinking that led to people believing the Earth was flat and everything revolves around us. It is not only egocentric but flat out apprehensive to need a safe space to discuss and debate. How will students possibly transition into the real world if they cannot have a simple discussion without their opinion being challenged? We need to not only be open to being wrong, but skeptical of being right.  ","from_kind":null,"is_self":true,"stickied":false,"over_18":false,"link_flair_css_class":"OPdelta","author_flair_css_class":null,"downs":0,"author_flair_text":null,"permalink":"/r/changemyview/comments/4xsg8k/cmv_safe_spaces_are_unhealthy_because_college/","hide_score":false,"from_id":null,"name":"t3_4xsg8k","id":"4xsg8k","distinguished":null,"edited":false,"locked":false,"gilded":0,"url":"https://www.reddit.com/r/changemyview/comments/4xsg8k/cmv_safe_spaces_are_unhealthy_because_college/","secure_media":null,"archived":false,"domain":"self.changemyview","retrieved_on":1473047261,"media_embed":{},"score":3048,"created_utc":1471245441,"author":"mackenzor","quarantine":false,"saved":false,"from":null,"title":"CMV: Safe spaces are unhealthy because college students need to stop hiding from views that upset them.","subreddit":"changemyview","thumbnail":"self","subreddit_id":"t5_2w2s8","media":null,"secure_media_embed":{},"num_comments":953,"ups":3048}
